class Details {
  List<Map> details = [
    {"title": "데이터 판매(샘플)",
    "id": "10000",
    "type": "리워드",
    "date": "2023-01-01 23:59:59",
    "point": "+ 15,000 P",
    "buyer": "(주)테스트회사",
    "info": ["닉네임", "연령층",  "이메일", "성함", "휴대폰", "성별","출생연도","결혼정보","자녀정보","최종학력","직업","소득수준","거주지역","관심사 1","관심사 2","관심사 3"]},
    {"title": "텔레마케팅 판매(샘플)",
    "id": "20000",
    "type": "리워드",
    "date": "2023-01-01 23:59:59",
    "point": "+ 20,000 P",
    "buyer": "(주)테스트회사",
    "info": ["닉네임", "연령층",  "이메일", "성함", "휴대폰","텔레마케팅","성별","출생연도","결혼정보","자녀정보","최종학력","직업","소득수준","거주지역","관심사 1"]},
    {"title": "출금(샘플)",
    "id": "30000",
    "type": "출금",
    "date": "2023-01-01 23:59:59",
    "point": "- 10,000 P",
    "withdraw": "10,000 P",
    "fee": "0 P",
    "tax": "660 원",
    "amount": "9,340 원",
    "account": ["홍길동", "카카오뱅크 3333123456789"],
    "status" : "접수"}];

//   List get details => _details;
//   void addDetail(Map newDetail){
//     _details.add(newDetail);
//   }
}