class Details {
  List<Map> details = [
    {"title": "데이터 판매(샘플)",
    "id": "10000",
    "type": "리워드",
    "date": "2023-01-01 23:59:59",
    "point": "+ 15,000 P",
    "buyer": "(주)테스트회사",
    "info": ["닉네임", "연령층",  "이메일", "성함", "휴대폰", "성별","출생연도","결혼정보","자녀정보","최종학력","직업","소득수준","거주지역","관심사 1","관심사 2","관심사 3"]},
    {"title": "텔레마케팅 판매(샘플)",
    "id": "20000",
    "type": "리워드",
    "date": "2023-01-01 23:59:59",
    "point": "+ 20,000 P",
    "buyer": "(주)테스트회사",
    "info": ["닉네임", "연령층",  "이메일", "성함", "휴대폰","텔레마케팅","성별","출생연도","결혼정보","자녀정보","최종학력","직업","소득수준","거주지역","관심사 1"]},
    {"title": "출금(샘플)",
    "id": "30000",
    "type": "출금",
    "date": "2023-01-01 23:59:59",
    "point": "- 10,000 P",
    "withdraw": "10,000 P",
    "fee": "0 P",
    "tax": "660 원",
    "amount": "9,340 원",
    "account": ["홍길동", "카카오뱅크 3333123456789"],
    "status" : "접수"}];

  List<Map> notices = [
    {"id": "20000",
    "type": "tele", 
    "title": "[데이플러스] 텔레마케팅 접수 안내",
    "content": "텔레마케팅 구매가 접수되었습니다. 업체의 마케팅 전화를 유의하세요.",
    "date": "2023.01.01 23:59:59",
    "tmdata": {
      "buyer": "(주)테스트회사",
      "cotact": "02)1234-5678",
      "state": "거래접수"
    }},
    {"id": "10000",
    "type": "normal", 
    "title": "[데이플러스] 리워드 안내",
    "content": "판매 접수된 정보가 구매 확정되어 포인트가 적립되었습니다!",
    "date": "2023.01.01 23:59:59" }
  ];

//   List get details => _details;
//   void addDetail(Map newDetail){
//     _details.add(newDetail);
//   }
}